"""Задание 1: Определение возраста для доступа
Напишите программу, которая спрашивает у пользователя его возраст и выводит следующее:

Если возраст меньше 18, вывести: "Вам не разрешено участвовать".
Если возраст от 18 до 25 включительно, вывести: "Добро пожаловать в молодежную группу".
Если возраст больше 25, вывести: "Добро пожаловать во взрослую группу"."""
# num1 = int(input("Введите возраст: "))
# if 0 <= num1 <= 17:
#      print("Доступ запрещон: ")
# elif 18 <= num1 <= 25:
#     print("Можете войти")
# elif 25 <= num1 <= 99:
#     print("Добро пожаловать во взрослую группу")

# else:
#     print("Некорректный ввод")



"""Задание 2:
Напишите программу, которая будет запрашивать у пользователя два числа. Программа должна выводить,
 какое из чисел больше. Если числа равны, программа должна вывести сообщение, что числа равны.

Условия:

Если оба числа больше 10, программа должна вывести "Оба числа большие".
Если хотя бы одно из чисел больше 50, программа должна вывести "Одно из чисел очень большое".
Если ни одно из чисел не соответствует условиям выше, программа должна просто вывести, какое из них больше или что они равны."""
# num1 = float(input("Введите первое число: "))
# num2 = float(input("Введите второе число: "))
# if num1 > 50 or num2 > 50:
#     print("Одно из чисел очень большое.")
# elif num1 > 10 and num2 > 10:
#     print("Оба числа большие.")
# elif num1 > num2:
#     print(num1, "больше, чем", num2)
# elif num1 < num2:
#     print(num2, "больше, чем", num1)
# else:
#     print("Числа равны.")


"""Задание 3:
Создайте программу, которая просит пользователя ввести три числа. Программа должна проверить следующие условия:

Условия:

Если все три числа положительные, программа выводит "Все числа положительные".
Если хотя бы одно из чисел отрицательное, программа выводит "Есть отрицательное число".
Если два числа положительные и одно отрицательное, программа выводит "Два положительных числа и одно отрицательное".
Если хотя бы одно из чисел равно 0, программа выводит "Есть число, равное нулю"."""
# num1 = float(input("Введите первое число: "))
# num2 = float(input("Введите второе число: "))
# num3 = float(input("Введите третий число: "))
# if num1 == num2 or num1 == num3:
#     print("Все числы положительные")    



'''''Новая тема'''
